/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 03.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* Item property names */
"itemProperty.lastModified" = "แก้ไขครั้งล่าสุด";
"itemProperty.isFavorite" = "รายการโปรด";
"itemProperty.localAttributes" = "แอตทริบิวต์ต้นทาง";

/* Item policy */
"Available Offline" = "พร้อมใช้งานแบบออฟไลน์แล้ว";

/* Cellular Switches */
"Allow cellular access" = "อนุญาตการเข้าถึงเครือข่ายมือถือ";

/* Connection Progress */
"Connecting…" = "กำลังเชื่อมต่อ...";
"Authenticating…" = "กำลังตรวจสอบสิทธิ์...";
"Error" = "ข้อผิดพลาด";
"Fetching user information…" = "กำลังเรียกข้อมูลผู้ใช้...";
"Connected" = "เชื่อมต่อ";

"Retrieving thumbnail…" = "กำลังเรียกดูภาพขนาดย่อ...";

"Cancel" = "ยกเลิก";
"Proceed" = "ดำเนินการ";
"OK" = "ตกลง";

/* Database upgrades */
"Upgrading database…" = "กำลังอัปเกรดฐานข้อมูล...";

/* Connection setup */
"Insecure HTTP URL" = "URL ที่เชื่อมต่อผ่าน HTTP ไม่ปลอดภัย";
"The URL you provided uses the HTTP rather than the HTTPS scheme. If you continue, your communication will not be encrypted." = "URL ที่คุณระบุใช้โปรโตคอล HTTP หากคุณดำเนินการต่อการสื่อสารของคุณจะไม่ถูกเข้ารหัส (แนะนำให้ใช้ HTTPS แทน)";

"Insecure HTTP URL forbidden" = "ห้ามใช้ URL HTTP ที่ไม่ปลอดภัย";
"The URL you provided uses the HTTP rather than the HTTPS scheme, so your communication would not be encrypted." = "คถุณกำลังใช้งาน URL HTTP แทนที่จะเป็นรูปแบบ HTTPS ดังนั้นการสื่อสารของคุณจะไม่ถูกเข้ารหัส";

/* Connection status */
"Offline" = "ออฟไลน์";
"Offline (no WiFi connection)" = "ออฟไลน์ (ไม่มีการเชื่อมต่อWiFi)";
"Server down for maintenance" = "เซิร์ฟเวอร์กำลังอยู่ในช่วงปิดปรับปรุง";
"Network unavailable" = "เครือข่ายใช้งานไม่ได้";
"Online" = "ออนไลน์";
"Previous token refresh attempts indicated an invalid refresh token." = "ความพยายามในการรีเฟรชโทเค็นก่อนหน้านี้ระบุว่า refresh_token ไม่ถูกต้อง";
"Server returns status %ld" = "เซิร์ฟเวอร์ตอบกลับสถานะ %ld";

/* Copies */
"copy" = "คัดลอก";

/* Delete */
"%@ changed on the server. Really delete it?" = "%@ได้เปลี่ยนเซิร์ฟเวอร์แล้ว ต้องการลบ?";
"%@ has changed on the server since you requested its deletion." = "%@ ได้เปลี่ยนเซิร์ฟเวอร์แล้วตั้งแต่คุณขอให้ลบ";
"Delete" = "ลบ";

"%@ couldn't be deleted" = "%@ไม่สามารถลบได้ ";
"Please check if you have sufficient permissions to delete %@." = "โปรดตรวจสอบว่าคุณมีสิทธิ์เพียงพอที่จะลบ %@";

/* Move/Rename/Copy */
"Operation forbidden" = "หยุดการทำงาน";
"%@ can't be copied to %@." = "ไม่สามารถคัดลอก %@ ไปที่ %@";
"%@ can't be moved to %@." = "ไม่สามารถย้าย %@ ไปที่ %@";

"%@ not found" = "ไม่พบ %@";
"%@ wasn't found at %@." = "ไม่พบ %@ ที่ %@";

"The target directory %@ doesn't seem to exist." = "ไม่พบไดเร็กทอรี %@";

"%@ already exists" = "%@มีอยู่แล้ว ";
"Couldn't copy %@ to %@, because an item called %@ already exists there." = "ไม่สามารถคัดลอก %@ ไปยัง %@ เนื่องจากรายการ %@ ถูกเรียกใช้อยู่";
"Couldn't move %@ to %@, because an item called %@ already exists there." = "ไม่สามารถย้าย %@ ไปยัง %@ เนื่องจากรายการ %@ มีอยู่แล้ว";

"Insufficient permissions" = "สิทธิ์ไม่เพียงพอ";
"%@ can't be copied to %@." = "ไม่สามารถคัดลอก %@ ไปที่ %@";
"%@ can't be moved to %@." = "ไม่สามารถย้าย %@ ไปที่ %@";

"%@ not found on the server" = "%@ไม่พบบนเซิร์ฟเวอร์ ";
"%@ may have been renamed, moved or deleted remotely." = "%@ อาจถูกเปลี่ยนชื่อ ย้ายหรือลบออกไปแล้วโดยรีโมท\n";

"Error copying %@" = "เกิดข้อผิดพลาดขณะคัดลอก %@";
"Error moving %@" = "เกิดข้อผิดพลาดขณะย้าย %@";

"Renaming %@ to %@…" = "กำลังเปลี่ยนชื่อ %@ เป็น %@...";
"Moving %@ to %@…" = "กำลังย้าย %@ ไปยัง %@...";
"Copying %@ to %@…" = "กำลังคัดลอก %@ ไปยัง %@...";

/* Upload */
"Another item named %@ already exists in %@." = "อีกรายการชื่อ %@ มีอยู่แล้วใน %@";
"Not enough space left on the server to upload %@." = "พื้นที่เหลือบนเซิร์ฟเวอร์ไม่เพียงพอที่จะอัปโหลดไฟล์ %@";
"Uploads to this folder are not allowed." = "ไม่อนุญาตให้อัปโหลดไปยังโฟลเดอร์นี้";
"Replace" = "แทนที่";
"Keep both" = "เก็บไว้ทั้งสองอย่าง";

/* Download */
"Downloading %@…" = "กำลังดาวน์โหลด %@...";
"\"%@\" has been modified locally" = "\"%@\" ได้รับการแก้ไขแล้วในเครื่อง";
"A modified, unsynchronized version of \"%@\" is present on your device. Downloading the file from the server will overwrite it and modifications be lost." = "การแก้ไขและไม่ได้ถูกประสานข้อมูลของเวอร์ชัน \"%@\" จะแสดงอยู่บนอุปกรณ์ของคุณ การดาวน์โหลดไฟล์จากเซิร์ฟเวอร์จะเขียนทับไฟล์ดังกล่าวและการแก้ไขจะสูญหายไป";
"Invalid checksum" = "การตรวจสอบไม่ถูกต้อง";
"The downloaded file's checksum does not match the checksum provided by the server." = "ไม่พบทรัพยากร";
"File modified locally" = "ไฟล์ที่ถูกแก้ไขในเครื่อง";
"\"%@\" was modified locally before the download completed." = "\"%@\" ได้ถูกแก้ไขในเครื่องก่อนที่การดาวน์โหลดจะเสร็จสมบูรณ์";
"Couldn't download %@" = "ไม่สามารถดาวน์โหลด %@";
"The contents of the file on the server has changed since initiating download - or the file is no longer available on the server." = "เนื้อหาของไฟล์บนเซิร์ฟเวอร์มีการเปลี่ยนแปลงตั้งแต่เริ่มดาวน์โหลด - หรือไฟล์ไม่พร้อมใช้งานบนเซิร์ฟเวอร์อีกต่อไป";

/* Create folder */
"Creating folder %@…" = "กำลังสร้างโฟลเดอร์ %@...";

/* Delete */
"Deleting %@…" = "กำลังลบ %@...";

/* Retrieving file list */
"Retrieving file list for %@…" = "กำลังเรียกดูรายการไฟล์สำหรับ %@...";

/* Status */
"Pending" = "อยู่ระหว่างดำเนินการ";
"Running" = "กำลังรัน";
"Failed" = "ล้มเหลว";
"Waiting for user" = "กำลังรอผู้ใช้";
"Waiting for metadata refresh" = "กำลังรอการรีเฟรชข้อมูลเมตา";
"Waiting to retry (%ld of %ld)" = "กำลังรอเพื่อลองใหม่ (%ld จาก %ld)";
"Fetching updates…" = "กำลังเรียกอัปเดตข้อมูล...";
"Retrieving items for %@" = "กำลังดึงรายการสำหรับ %@";

/* Update */
"\"%@\" metadata for %@ couldn't be updated" = "\"%@\" metadata สำหรับ %@ ไม่สามารถอัปเดตได้";
"Update failed with status code %d" = "อัปเดตล้มเหลวด้วยรหัสสถานะ: %d";
"Error updating %@ metadata" = "เกิดข้อผิดพลาดขณะอัปเดต metadata %@";

/* Logging */
"Standard error output" = "ข้อมูลข้อผิดพลาดมาตรฐาน";
"Log file" = "ไฟล์ log";
"Log HTTP requests and responses" = "บันทึกคำขอและการตอบกลับ HTTP";
"Log internal file operations" = "Log การทำงานของไฟล์ภายใน";

/* Certificate checks */
"Certificate changed" = "เปลี่ยนใบรับรองแล้ว";

/* Errors */
"Server doesn't seem to support any authentication method supported by this app." = "เซิร์ฟเวอร์ดูเหมือนจะไม่รองรับวิธีการรับรองความถูกต้องใดๆ ที่แอปนี้สนับสนุน";
"This server runs an unsupported version (%@). Version %@ or later is required by this app." = "เซิร์ฟเวอร์นี้กำลังใช้เวอร์ชันที่ไม่ได้รับการสนับสนุน (%@) เวอร์ชัน %@ หรือเก่ากว่าที่แอปนี้ต้องการ";

/* DAV Errors */
// OCDAVErrorServiceUnavailable
"Server down for maintenance." = "เซิร์ฟเวอร์กำลังอยู่ในช่วงปิดปรับปรุง";
// OCDAVErrorNotFound
"Resource not found." = "ไม่พบทรัพยากร";

/* OC Errors */
"%@ (error %ld, %@)" = "%@(ข้อผิดพลาด %ld, %@)";
"%@ (error %ld)" = "%@ (ข้อผิดพลาด %ld)";

// OCErrorInternal
"Internal error." = "ข้อผิดพลาดภายใน";

// OCErrorInsufficientParameters
"Insufficient parameters." = "พารามิเตอร์ไม่เพียงพอ";

// OCErrorAuthorizationFailed
"Authorization failed." = "การให้สิทธิ์ล้มเหลว";

// OCErrorAuthorizationRedirect
"Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL." = "การอนุญาตล้มเหลวเนื่องจากเซิร์ฟเวอร์ส่งคืนการเปลี่ยนเส้นทาง ลองใช้ URL การเปลี่ยนเส้นทางใหม่";

// OCErrorAuthorizationNoMethodData
"Authorization failed because no secret data was set for the authentication method." = "การอนุญาตล้มเหลวเนื่องจากไม่มีการตั้งค่าข้อมูลลับสำหรับวิธีการตรวจสอบสิทธิ์";

// OCErrorAuthorizationMissingData
"Authorization failed because data was missing from the secret data for the authentication method." = "การอนุญาตล้มเหลวเนื่องจากข้อมูลลับสำหรับการตรวจสอบสิทธิ์หายไป";

// OCErrroAuthorizationCancelled
"Authorization was cancelled by the user." = "การอนุญาตถูกยกเลิกแล้วโดยผู้ใช้";

// OCErrorRequestURLSessionTaskConstructionFailed
"Construction of URL Session Task failed." = "การสร้าง URL งานเซสชันล้มเหลว";

// OCErrorNewerVersionExists
"A newer version already exists." = "มีเวอร์ชันใหม่ออกมาแล้ว";

// OCErrorRequestCancelled
"Request was cancelled." = "คำขอถูกยกเลิก";

// OCErrorRequestRemovedBeforeScheduling
"Request was removed before scheduling." = "คำขอถูกลบออกก่อนกำหนดเวลา";

// OCErrorRequestServerCertificateRejected
"Request was cancelled because the server certificate was rejected." = "คำขอถูกยกเลิกเนื่องจากใบรับรองเซิร์ฟเวอร์ถูกปฏิเสธ";

// OCErrorRequestDroppedByURLSession
"Request was dropped by the NSURLSession." = "คำร้องขอถูกยกเลิกแล้วโดย NSURLSession";

// OCErrorRequestCompletedWithError
"Request completed with error." = "คำขอเสร็จสิ้นแต่มีข้อผิดพลาดเกิดขึ้น";

// OCErrorRequestURLSessionInvalidated
"Request couldn't be scheduled because the underlying URL session has been invalidated." = "ไม่สามารถกำหนดเวลาคำขอได้เนื่องจากเซสชัน URL พื้นฐานนั้นไม่ถูกต้อง";

// OCErrorException
"An exception occured." = "มีข้อยกเว้นเกิดขึ้น";

// OCErrorResponseUnknownFormat
"Response was in an unknown format." = "มีการตอบสนองในรูปแบบที่ไม่รู้จัก";

// OCErrorServerDetectionFailed
"Server detection failed, i.e. when the server at a URL is not an ownCloud instance." = "การตรวจหาเซิร์ฟเวอร์ล้มเหลวเช่น เมื่อใช้ URL ของเซิร์ฟเวอร์ที่ไม่ใช่อินสแตนซ์ของ ownCloud";

// OCErrorServerTooManyRedirects
"Server detection failed because of too many redirects." = "การตรวจหาเซิร์ฟเวอร์ล้มเหลวเนื่องจากมีการเปลี่ยนเส้นทางมากเกินไป";

// OCErrorServerBadRedirection
"Server redirection to bad/invalid URL." = "เซิร์ฟเวอร์เปลี่ยนเส้นทางไปยัง URL ที่ไม่ถูกต้อง";

// OCErrorServerVersionNotSupported
"This server version is not supported." = "ยังไม่รองรับเซิร์ฟเวอร์เวอร์ชันนี้";

// OCErrorServerNoSupportedAuthMethods
"Server doesn't seem to support any authentication method supported by this app." = "เซิร์ฟเวอร์ดูเหมือนจะไม่รองรับวิธีการรับรองความถูกต้องใดๆ ที่แอปนี้สนับสนุน";

// OCErrorCertificateInvalid
"The certificate is invalid or contains errors" = "ใบรับรองไม่ถูกต้องหรือมีข้อผิดพลาด";

// OCErrorCertificateMissing
"No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests)." = "ไม่มีการส่งคืนใบรับรองสำหรับคำขอแม้ว่าจะเป็นการเชื่อมต่อแบบ HTTPS (คุณอาจจะลืมระบุใบรับรองในระหว่างการตอบกลับคำขอของ HTTPS)";

// OCErrorFeatureNotSupportedForItem
"This feature is not supported for this item." = "คุณสมบัตินี้ไม่รองรับสำหรับรายการนี้";

// OCErrorFeatureNotSupportedByServer
"This feature is not supported for this server (version)." = "เซิร์ฟเวอร์ยังไม่รองรับคุณสมบัตินี้";

// OCErrorFeatureNotImplemented
"This feature is currently not implemented" = "ยังไม่เปิดใช้งานคุณลักษณะนี้ในปัจจุบัน";

// OCErrorItemNotFound
"The targeted item has not been found." = "ไม่พบรายการเป้าหมาย";

// OCErrorItemDestinationNotFound
"The destination item has not been found." = "ไม่พบรายการปลายทาง";

// OCErrorItemChanged
"The targeted item has changed." = "รายการเป้าหมายมีการเปลี่ยนแปลง";

// OCErrorItemInsufficientPermissions
"The action couldn't be performed on the targeted item because the client lacks permissions." = "ไคลเอนต์ไม่มีสิทธิ์ดำเนินการกับรายการเป้าหมาย";

// OCErrorItemOperationForbidden
"The operation on the targeted item is not allowed." = "ไม่อนุญาตให้ดำเนินการกับรายการเป้าหมาย";

// OCErrorItemAlreadyExists
"There already is an item at the destination of this action." = "มีการกระทำรายการนี้อยู่ที่ปลายทางแล้ว";

// OCErrorItemNotAvailableOffline
"Item not available offline." = "รายการไม่พร้อมใช้งานในโหมดออฟไลน์";

// OCErrorFileNotFound:
"File not found." = "ไม่พบไฟล์";

// OCErrorCancelled
"The operation was cancelled." = "การดำเนินการถูกยกเลิก";

// OCErrorOutdatedCache
"An operation failed due to outdated cache information." = "การดำเนินการล้มเหลวเนื่องจากข้อมูลแคชที่ล้าสมัย";

// OCErrorRunningOperation
"A running operation prevents execution." = "การดำเนินการที่ทำงานอยู่จะป้องกันการดำเนินการอื่นๆ";

// OCErrorShareUnauthorized:
"Not authorized to access shares." = "ไม่ได้รับอนุญาตให้เข้าถึงแชร์";

// OCErrorShareUnavailable
"Shares are unavailable." = "แชร์ไม่พร้อมใช้งาน";

// OCErrorShareItemNotADirectory:
"Item is not a directory." = "รายการไม่ใช่ไดเร็กทอรี";

// OCErrorShareItemNotFound
"Item not found." = "ไม่พบรายการ";

// OCErrorShareNotFound
"Share not found." = "ไม่พบการแชร์";

// OCErrorShareUnknownType
"Unknown share type." = "ประเภทการแชร์ที่ไม่รู้จัก";

// OCErrorSharePublicUploadDisabled
"Public upload was disabled by the administrator." = "การอัปโหลดสาธารณะถูกปิดใช้งานโดยผู้ดูแลระบบ";

// OCErrorNotAvailableOffline
"Not available offline." = "ไม่สามารถใช้งานออฟไลน์ได้";

// OCErrorAuthorizationRetry
"Authorization needs to be retried." = "ลองให้สิทธิ์อีกครั้ง";

// OCErrorItemPolicyRedundant
"Another item policy of the same kind already includes the item, making the addition of this item policy redundant." = "นโยบายสินค้าซ้ำกับสินค้าที่มีอยู่แล้ว ทำให้ไม่สามารถเพิ่มนโยบาย";

// OCErrorItemPolicyMakesRedundant
"Other item policies of the same kind covering subsets of this item policy become redundant by the addition of this item policy." = "นโยบายรายการซ้ำกับนโยบายมีอยู่แล้ว ทำให้ไม่สามารถเพิ่มนโยบาย";

// OCErrorUnnormalizedPath
"The provided path is not normalized." = "เส้นทางที่ระบุไม่ได้ถูกทำให้เป็นมาตรฐาน";

// OCErrorPrivateLinkInvalidFormat
"Private link format invalid." = "รูปแบบลิงก์ส่วนตัวไม่ถูกต้อง";

// OCErrorPrivateLinkResolutionFailed
"Resolution of private link failed." = "การแก้ไขลิงก์ส่วนตัวล้มเหลว";

// OCErrorAuthorizationMethodNotAllowed
"Authentication method not allowed. Re-authentication needed." = "ไม่อนุญาตให้ใช้วิธีการรับรองความถูกต้อง จำเป็นต้องมีการตรวจสอบสิทธิ์อีกครั้ง";

// OCErrorAuthorizationMethodUnknown
"Authentication method unknown." = "ไม่รู้จักวิธีการรับรองความถูกต้อง";

// OCErrorServerConnectionValidationFailed
"Connection validation failed." = "ตรวจสอบการเชื่อมต่อล้มเหลว";

// OCErrorAuthorizationClientRegistrationFailed
"Client registration failed." = "การลงทะเบียนไคลเอนต์ล้มเหลว";

// OCErrorAuthorizationNotMatchingRequiredUserID
"The logged in user is not matching the required user ID." = "ผู้ใช้ที่ล็อกอินไม่ตรงกับ ID ผู้ใช้ที่ต้องการ";
"You logged in as user %@, but must log in as user %@. Please retry." = "คุณเข้าสู่ระบบในฐานะผู้ใช้ %@ แต่จำเป็นต้องเข้าสู่ระบบในฐานะผู้ใช้ %@ โปรดลองอีกครั้ง";
"Login as user %@ required. Please retry." = "กรุณาเข้าสู่ระบบด้วยฐานะ %@ โปรดลองอีกครั้ง";

// OCErrorDatabaseMigrationRequired
"Database upgrade required. Please open the app to perform the upgrade." = "จำเป็นต้องอัปเกรดฐานข้อมูล โปรดเปิดแอปเพื่อทำการอัปเกรด";

// OCErrorHostUpdateRequired
"Bookmark created with a newer app version. Please update the app." = "สร้างบุ๊กมาร์กด้วยแอปเวอร์ชันใหม่กว่า โปรดอัปเดตแอป";

/* Diagnostic */
"Files" = "ไฟล์";
"Folders" = "สร้างโฟลเดอร์ใหม่";
"Total Items" = "รายการทั้งหมด";
"Removed Items" = "รายการถูกลบแล้ว";
"Scheduled folder scans" = "สแกนโฟลเดอร์กำหนดการแล้ว";
"Sync Record ID"  = "Sync Record ID";
"State" = "สถานะ";
"In progress since" = "อยู่ระหว่างดำเนินการตั้งแต่";
"Origin Process" = "กระบวนการกำเนิด";
"Origin Process Valid" = "กระบวนการกำเนิดที่ถูกต้อง";
"Timestamp" = "ประทับเวลา";
"Lane ID" = "Lane ID";
"Local ID" = "Local ID";
"Action ID" = "รหัสการดำเนินการ";
"Process Sync Records" = "ประมวลผลบันทึกการซิงค์";
"Reschedule" = "กำหนดเวลาใหม่";
"Deschedule (remove)" = "ลบกำหนดการ";
"Action" = "การกระทำ";
"Wait Conditions" = "เงื่อนไขการรอ";
"Events" = "เหตุการณ์";
"Class" = "หมวดหมู่";
"Identifier" = "ระบุ";
"Localized Description" = "คำอธิบายที่แปลเป็นภาษาท้องถิ่น";
"Database size" = "ขนาดของฐานข้อมูล";
"Thumbnail database size" = "ขนาดฐานข้อมูลภาพขนาดย่อ";
"Vacuum" = "เครื่องดูดฝุ่น";
"UUID" = "UUID";
"Name" = "ชื่อ";
"URL" = "URL";
"Origin URL" = "URL ต้นทาง";
"Use Origin URL as URL" = "ใช้ URL ต้นทางเป็น URL";
"Certificate Date" = "วันที่รับรอง";
"Invalidate Certificate" = "ใบรับรองไม่ถูกต้อง";
"User Name" = "ชื่อผู้ใช้";
"Auth Method" = "วิธีการรับรองความถูกต้อง";
"Auth Data" = "ข้อมูลรับรองความถูกต้อง";
"Auth Validation Date" = "วันที่ตรวจสอบสิทธิ์";
"Database Version" = "เวอร์ชันฐานข้อมูล";
"UserInfo" = "ข้อมูลผู้ใช้";
"Invalidate Login Data" = "ข้อมูลการเข้าสู่ระบบไม่ถูกต้อง";
"Delete Authentication Data" = "ลบข้อมูลการรับรองความถูกต้อง";
"Remove Database Version" = "ลบเวอร์ชันฐานข้อมูล";
"Delete Database" = "ลบฐานข้อมูล";
"Removed database at %@" = "ลบฐานข้อมูลเมื่อ %@";
"Removed thumbnail database at %@" = "ลบฐานข้อมูลของรูปภาพขนาดย่อเมื่อ %@";
